reading-note/10x程序员工作法.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-05 一 20:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>10x 程序员工作法笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">10x 程序员工作法笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgba9a206">1. 开篇词:程序员解决的问题，大多不是程序问题</a></li>
<li><a href="#orgdb4c27d">2. 10x 程序员是如何思考的？</a></li>
<li><a href="#orgc171f46">3. 如何让你的努力不白费？（以终为始）</a></li>
<li><a href="#org4a4a2f1">4. 你完成了工作，为什么他们还不满意？（终的共识？）</a></li>
<li><a href="#orgf998b36">5. 接到需求任务，要先做哪件事？（如何定义终？）</a></li>
<li><a href="#orgd5b32ec">6. 持续集成：集成本身就是写代码的一个环节（如何高效产生终）</a></li>
<li><a href="#orgafc7886">7. 精益创业：产品经理不靠谱，应该怎么办？（如何定义正确的终）</a></li>
<li><a href="#orgdf396ac">8. 解决了很多技术问题，为什么你还在坑里？（高层级的终）</a></li>
<li><a href="#org5bd5a19">9. 为什么说做事之前要先进行推演？（避免无用的终）</a></li>
<li><a href="#orgeba9a78">10. 你的工作量可以用数字衡量么？（可量化的终）</a></li>
<li><a href="#org463f99d">11. 启动开发之前，应该准备什么？（）</a></li>
</ul>
</div>
</div>
<p>
本文是极客时间<a href="https://time.geekbang.org/column/intro/148">《10x 程序员工作法》</a>笔记。
</p>

<div id="outline-container-orgba9a206" class="outline-2">
<h2 id="orgba9a206"><span class="section-number-2">1</span> 开篇词:程序员解决的问题，大多不是程序问题</h2>
<div class="outline-text-2" id="text-1">
<p>
本质复杂度：解决一个问题时，无论怎么做都必须要做的事。
</p>

<p>
偶然复杂度：因为选用的做事方法不当，而导致要多做的事。
</p>

<p>
<b>大部分程序员忙碌解决的问题，都不是程序问题，而是由偶然复杂度导致的问题。</b>
</p>
</div>
</div>


<div id="outline-container-orgdb4c27d" class="outline-2">
<h2 id="orgdb4c27d"><span class="section-number-2">2</span> 10x 程序员是如何思考的？</h2>
<div class="outline-text-2" id="text-2">
<p>
思考框架：
</p>
<ul class="org-ul">
<li>现状</li>
<li>目标</li>
<li>路径</li>
</ul>

<p>
实现原则：
</p>
<ul class="org-ul">
<li>以始为终，避免 x-y 问题。</li>
<li>任务分解</li>
<li>沟通反馈</li>
<li>自动化</li>
</ul>
</div>
</div>

<div id="outline-container-orgc171f46" class="outline-2">
<h2 id="orgc171f46"><span class="section-number-2">3</span> 如何让你的努力不白费？（以终为始）</h2>
<div class="outline-text-2" id="text-3">
<p>
任何事物都要经过两次创造：头脑中的创造和付诸实践。
</p>

<p>
<b>以终为始：遇到事情，倒着想。</b> 先确定最终目标，然后开始行动，以结果为导向。
</p>

<p>
实践：计划倒排。
</p>
</div>
</div>

<div id="outline-container-org4a4a2f1" class="outline-2">
<h2 id="org4a4a2f1"><span class="section-number-2">4</span> 你完成了工作，为什么他们还不满意？（终的共识？）</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>做任何事之前，先定义完成的标准。</b>
</p>

<p>
实践：DoD（Definition of Done）是一个思维模式，是一种尽可能消除不确定性，达成共识的方式。
</p>

<p>
DoD 可以用来：
</p>
<ul class="org-ul">
<li>确定功能需求点。</li>
<li>明确开发进度。</li>
</ul>
</div>
</div>

<div id="outline-container-orgf998b36" class="outline-2">
<h2 id="orgf998b36"><span class="section-number-2">5</span> 接到需求任务，要先做哪件事？（如何定义终？）</h2>
<div class="outline-text-2" id="text-5">
<p>
功能列表式需求描述过于琐碎，不能完整的描述需求场景。
</p>

<p>
用户故事-一种新的需求描述方式：
</p>
<ul class="org-ul">
<li>标题</li>
<li>概述，简述故事主要内容。</li>
<li>详述，故事完整流程。</li>
<li>验收标准，给出了需求最基本的测试用例，保证开发人员需求最基本的质量。（很重要）</li>
</ul>

<p>
有了验收标准，开发可以编写集成测试用例，测试也可以完成测试用例。
</p>
</div>
</div>

<div id="outline-container-orgd5b32ec" class="outline-2">
<h2 id="orgd5b32ec"><span class="section-number-2">6</span> 持续集成：集成本身就是写代码的一个环节（如何高效产生终）</h2>
<div class="outline-text-2" id="text-6">
<p>
开发人员交付的是可运行的软件，不是代码。
</p>

<p>
实践：尽早提交代码去集成。
</p>
</div>
</div>

<div id="outline-container-orgafc7886" class="outline-2">
<h2 id="orgafc7886"><span class="section-number-2">7</span> 精益创业：产品经理不靠谱，应该怎么办？（如何定义正确的终）</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>软件开发的方向是不确定的。</b> 所以需要产品经理对需求能做出合理的解释，预期以及度量方法。
</p>

<p>
精益：理解价值创造与浪费之间的关系。简而言之，如何低成本的试错。
</p>

<p>
实践：默认所有需求都不做，直到弄清楚为什么要做这件事。
</p>
</div>
</div>

<div id="outline-container-orgdf396ac" class="outline-2">
<h2 id="orgdf396ac"><span class="section-number-2">8</span> 解决了很多技术问题，为什么你还在坑里？（高层级的终）</h2>
<div class="outline-text-2" id="text-8">
<p>
不同角色工作上的真正差异是上下文的不同。
</p>

<p>
有些技术问题完全可以通过对需求的理解解决（绕过去）。
</p>

<p>
跳出程序员角色思维，扩大自己工作的上下文。不要独善其身，眼光要长远和提高层级。
</p>
</div>
</div>

<div id="outline-container-org5bd5a19" class="outline-2">
<h2 id="org5bd5a19"><span class="section-number-2">9</span> 为什么说做事之前要先进行推演？（避免无用的终）</h2>
<div class="outline-text-2" id="text-9">
<p>
动手做事之前，先推演一番：
</p>
<ul class="org-ul">
<li>清楚目标达成过程。</li>
<li>避免努力白费。</li>
</ul>
</div>
</div>

<div id="outline-container-orgeba9a78" class="outline-2">
<h2 id="orgeba9a78"><span class="section-number-2">10</span> 你的工作量可以用数字衡量么？（可量化的终）</h2>
<div class="outline-text-2" id="text-10">
<p>
实践：量化自己的工作。
</p>
</div>
</div>

<div id="outline-container-org463f99d" class="outline-2">
<h2 id="org463f99d"><span class="section-number-2">11</span> 启动开发之前，应该准备什么？（）</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-08-05 一 20:29</p>
<p class="validation"></p>
</div>
</body>
</html>
